Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_mr.c
/*
 * CDDL HEADER START
 *
 * The contents of this file are subject to the terms of the
 * Common Development and Distribution License (the "License").
 * You may not use this file except in compliance with the License.
 *
 * You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
 * or http://www.opensolaris.org/os/licensing.
 * See the License for the specific language governing permissions
 * and limitations under the License.
 *
 * When distributing Covered Code, include this CDDL HEADER in each
 * file and include the License file at usr/src/OPENSOLARIS.LICENSE.
 * If applicable, add the following below this CDDL HEADER, with the
 * fields enclosed by brackets "[]" replaced with your own identifying
 * information: Portions Copyright [yyyy] [name of copyright owner]
 *
 * CDDL HEADER END
 */

/*
 *  Copyright (c) 2010, Oracle and/or its affiliates. All rights reserved.
 */

/*
 * mexnex_mr.c
 *    Mcxnex Memory Region/Window Routines
 *
 *    Implements all the routines necessary to provide the requisite memory
 *    registration verbs.  These include operations like RegisterMemRegion(),
 *    DeregisterMemRegion(), ReregisterMemRegion, RegisterSharedMemRegion,
 *    etc., that affect Memory Regions.  It also includes the verbs that
 *    affect Memory Windows, including AllocMemWindow(), FreeMemWindow(),
 *    and QueryMemWindow().
 */

#include <sys/types.h>
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>
#include <sys/modctl.h>
#include <sys/esunddi.h>

#include "mcxnex.h"

extern uint32_t mcxnex_kernel_data_ro;
extern uint32_t mcxnex_user_data_ro;

/*
 * Used by mcxnex_mr_keycalc() below to fill in the "unconstrained" portion
 * of Mcxnex memory keys (LKeys and RKeys)
 */
static	uint_t mcxnex_memkey_cnt = 0x00;
#define	MCXNEX_MEMKEY_SHIFT	 24
#define	MCXNEX_MPT_SW_OWNERSHIP	 0xF

static int mcxnex_mr_common_reg(mcxnex_state_t *state, mcxnex_pdhdl_t pd,
    mcxnex_bind_info_t *bind, mcxnex_mrhdl_t *mrhdl, mcxnex_mr_options_t *op,
    mcxnex_mpt_rsrc_type_t mpt_type);
static int mcxnex_mr_common_rereg(mcxnex_state_t *state, mcxnex_mrhdl_t mr,
    mcxnex_pdhdl_t pd, mcxnex_bind_info_t *bind, mcxnex_mrhdl_t *mrhdl_new,
    mcxnex_mr_options_t *op);
static int mcxnex_mr_rereg_xlat_helper(mcxnex_state_t *state, mcxnex_mrhdl_t mr,
    mcxnex_bind_info_t *bind, mcxnex_mr_options_t *op, uint64_t *mtt_addr,
    uint_t sleep, uint_t *dereg_level);
static uint64_t mcxnex_mr_nummtt_needed(mcxnex_state_t *state,
    mcxnex_bind_info_t *bind, uint_t *mtt_pgsize);
static int mcxnex_mr_mem_bind(mcxnex_state_t *state, mcxnex_bind_info_t *bind,
    ddi_dma_handle_t dmahdl, uint_t sleep, uint_t is_buffer);
static void mcxnex_mr_mem_unbind(mcxnex_state_t *state,
    mcxnex_bind_info_t *bind);
static int mcxnex_mr_fast_mtt_write(mcxnex_state_t *state, mcxnex_rsrc_t *mtt,
    mcxnex_bind_info_t *bind, uint32_t mtt_pgsize_bits);
static int mcxnex_mr_fast_mtt_write_fmr(mcxnex_rsrc_t *mtt,
    ibt_pmr_attr_t *mem_pattr, uint32_t mtt_pgsize_bits);
static uint_t mcxnex_mtt_refcnt_inc(mcxnex_rsrc_t *rsrc);
static uint_t mcxnex_mtt_refcnt_dec(mcxnex_rsrc_t *rsrc);


/*
 * The Mcxnex umem_lockmemory() callback ops.  When userland memory is
 * registered, these callback ops are specified.  The mcxnex_umap_umemlock_cb()
 * callback will be called whenever the memory for the corresponding
 * ddi_umem_cookie_t is being freed.
 */
static struct umem_callback_ops mcxnex_umem_cbops = {
	UMEM_CALLBACK_VERSION,
	mcxnex_umap_umemlock_cb,
};



/*
 * mcxnex_mr_register()
 *    Context: Can be called from interrupt or base context.
 */
int
mcxnex_mr_register(mcxnex_state_t *state, mcxnex_pdhdl_t pd,
    ibt_mr_attr_t *mr_attr, mcxnex_mrhdl_t *mrhdl, mcxnex_mr_options_t *op,
    mcxnex_mpt_rsrc_type_t mpt_type)
{
	mcxnex_bind_info_t	bind;
	int			status;

	/*
	 * Fill in the "bind" struct.  This struct provides the majority
	 * of the information that will be used to distinguish between an
	 * "addr" binding (as is the case here) and a "buf" binding (see
	 * below).  The "bind" struct is later passed to mcxnex_mr_mem_bind()
	 * which does most of the "heavy lifting" for the Mcxnex memory
	 * registration routines.
	 */
	bind.bi_type  = MCXNEX_BINDHDL_VADDR;
	bind.bi_addr  = mr_attr->mr_vaddr;
	bind.bi_len   = mr_attr->mr_len;
	bind.bi_as    = mr_attr->mr_as;
	bind.bi_flags = mr_attr->mr_flags;
	status = mcxnex_mr_common_reg(state, pd, &bind, mrhdl, op,
	    mpt_type);
	return (status);
}


/*
 * mcxnex_mr_register_buf()
 *    Context: Can be called from interrupt or base context.
 */
int
mcxnex_mr_register_buf(mcxnex_state_t *state, mcxnex_pdhdl_t pd,
    ibt_smr_attr_t *mr_attr, struct buf *buf, mcxnex_mrhdl_t *mrhdl,
    mcxnex_mr_options_t *op, mcxnex_mpt_rsrc_type_t mpt_type)
{
	mcxnex_bind_info_t	bind;
	int			status;

	/*
	 * Fill in the "bind" struct.  This struct provides the majority
	 * of the information that will be used to distinguish between an
	 * "addr" binding (see above) and a "buf" binding (as is the case
	 * here).  The "bind" struct is later passed to mcxnex_mr_mem_bind()
	 * which does most of the "heavy lifting" for the Mcxnex memory
	 * registration routines.  Note: We have chosen to provide
	 * "b_un.b_addr" as the IB address (when the IBT_MR_PHYS_IOVA flag is
	 * not set).  It is not critical what value we choose here as it need
	 * only be unique for the given RKey (which will happen by default),
	 * so the choice here is somewhat arbitrary.
	 */
	bind.bi_type  = MCXNEX_BINDHDL_BUF;
	bind.bi_buf   = buf;
	if (mr_attr->mr_flags & IBT_MR_PHYS_IOVA) {
		bind.bi_addr  = mr_attr->mr_vaddr;
	} else {
		bind.bi_addr  = (uint64_t)(uintptr_t)buf->b_un.b_addr;
	}
	bind.bi_as    = NULL;
	bind.bi_len   = (uint64_t)buf->b_bcount;
	bind.bi_flags = mr_attr->mr_flags;
	status = mcxnex_mr_common_reg(state, pd, &bind, mrhdl, op, mpt_type);
	return (status);
}


/*
 * mcxnex_mr_register_shared()
 *    Context: Can be called from interrupt or base context.
 */
int
mcxnex_mr_register_shared(mcxnex_state_t *state, mcxnex_mrhdl_t mrhdl,
    mcxnex_pdhdl_t pd, ibt_smr_attr_t *mr_attr, mcxnex_mrhdl_t *mrhdl_new)
{
	mcxnex_rsrc_t		*mpt, *mtt, *rsrc;
	mcxnex_umap_db_entry_t	*umapdb;
	mcxnex_hw_dmpt_t	mpt_entry;
	mcxnex_mrhdl_t		mr;
	mcxnex_bind_info_t	*bind;
	ddi_umem_cookie_t	umem_cookie;
	size_t			umem_len;
	caddr_t			umem_addr;
	uint64_t		mtt_addr, pgsize_msk;
	uint_t			sleep, mr_is_umem;
	int			status, umem_flags;

