Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_mr.c
	/* Decrement the reference count on the protection domain (PD) */
	mcxnex_pd_refcnt_dec(pd);

	/* Set the mrhdl pointer to NULL and return success */
	*mrhdl = NULL;

	return (DDI_SUCCESS);
}

/*
 * mcxnex_mr_invalidate_fmr()
 *    Context: Can be called from interrupt or base context.
 */
/* ARGSUSED */
int
mcxnex_mr_invalidate_fmr(mcxnex_state_t *state, mcxnex_mrhdl_t mr)
{
	mcxnex_rsrc_t		*mpt;
	uint64_t		*mpt_table;

	mutex_enter(&mr->mr_lock);
	mpt = mr->mr_mptrsrcp;
	mpt_table = (uint64_t *)mpt->hr_addr;

	/* Write MPT status to SW bit */
	ddi_put8(mpt->hr_acchdl, (uint8_t *)&mpt_table[0], 0xF);

	/* invalidate mem key value */
	ddi_put32(mpt->hr_acchdl, (uint32_t *)&mpt_table[1], 0);

	/* invalidate lkey value */
	ddi_put32(mpt->hr_acchdl, (uint32_t *)&mpt_table[4], 0);

	/* Write MPT status to HW bit */
	ddi_put8(mpt->hr_acchdl, (uint8_t *)&mpt_table[0], 0x0);

	mutex_exit(&mr->mr_lock);

	return (DDI_SUCCESS);
}

/*
 * mcxnex_mr_deregister_fmr()
 *    Context: Can be called from interrupt or base context.
 */
/* ARGSUSED */
int
mcxnex_mr_deregister_fmr(mcxnex_state_t *state, mcxnex_mrhdl_t mr)
{
	mcxnex_rsrc_t		*mpt;
	uint64_t		*mpt_table;

	mutex_enter(&mr->mr_lock);
	mpt = mr->mr_mptrsrcp;
	mpt_table = (uint64_t *)mpt->hr_addr;

	/* Write MPT status to SW bit */
	ddi_put8(mpt->hr_acchdl, (uint8_t *)&mpt_table[0], 0xF);
	mutex_exit(&mr->mr_lock);

	return (DDI_SUCCESS);
}


/*
 * mcxnex_mr_query()
 *    Context: Can be called from interrupt or base context.
 */
/* ARGSUSED */
int
mcxnex_mr_query(mcxnex_state_t *state, mcxnex_mrhdl_t mr,
    ibt_mr_query_attr_t *attr)
{
	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*attr))

	mutex_enter(&mr->mr_lock);

	/*
	 * Check here to see if the memory region has already been partially
	 * deregistered as a result of a mcxnex_umap_umemlock_cb() callback.
	 * If so, this is an error, return failure.
	 */
	if ((mr->mr_is_umem) && (mr->mr_umemcookie == NULL)) {
		mutex_exit(&mr->mr_lock);
		return (IBT_MR_HDL_INVALID);
	}

	/* Fill in the queried attributes */
	attr->mr_attr_flags = mr->mr_accflag;
	attr->mr_pd	= (ibt_pd_hdl_t)mr->mr_pdhdl;

	/* Fill in the "local" attributes */
	attr->mr_lkey = (ibt_lkey_t)mr->mr_lkey;
	attr->mr_lbounds.pb_addr = (ib_vaddr_t)mr->mr_bindinfo.bi_addr;
	attr->mr_lbounds.pb_len  = (size_t)mr->mr_bindinfo.bi_len;

	/*
	 * Fill in the "remote" attributes (if necessary).  Note: the
	 * remote attributes are only valid if the memory region has one
	 * or more of the remote access flags set.
	 */
	if ((mr->mr_accflag & IBT_MR_REMOTE_READ) ||
	    (mr->mr_accflag & IBT_MR_REMOTE_WRITE) ||
	    (mr->mr_accflag & IBT_MR_REMOTE_ATOMIC)) {
		attr->mr_rkey = (ibt_rkey_t)mr->mr_rkey;
		attr->mr_rbounds.pb_addr = (ib_vaddr_t)mr->mr_bindinfo.bi_addr;
		attr->mr_rbounds.pb_len  = (size_t)mr->mr_bindinfo.bi_len;
	}

	/*
	 * If region is mapped for streaming (i.e. noncoherent), then set sync
	 * is required
	 */
	attr->mr_sync_required = (mr->mr_bindinfo.bi_flags &
	    IBT_MR_NONCOHERENT) ? B_TRUE : B_FALSE;

	mutex_exit(&mr->mr_lock);
	return (DDI_SUCCESS);
}


/*
 * mcxnex_mr_reregister()
 *    Context: Can be called from interrupt or base context.
 */
int
mcxnex_mr_reregister(mcxnex_state_t *state, mcxnex_mrhdl_t mr,
    mcxnex_pdhdl_t pd, ibt_mr_attr_t *mr_attr, mcxnex_mrhdl_t *mrhdl_new,
    mcxnex_mr_options_t *op)
{
	mcxnex_bind_info_t	bind;
	int			status;

	/*
	 * Fill in the "bind" struct.  This struct provides the majority
	 * of the information that will be used to distinguish between an
	 * "addr" binding (as is the case here) and a "buf" binding (see
	 * below).  The "bind" struct is later passed to mcxnex_mr_mem_bind()
	 * which does most of the "heavy lifting" for the Mcxnex memory
	 * registration (and reregistration) routines.
	 */
	bind.bi_type  = MCXNEX_BINDHDL_VADDR;
	bind.bi_addr  = mr_attr->mr_vaddr;
	bind.bi_len   = mr_attr->mr_len;
	bind.bi_as    = mr_attr->mr_as;
	bind.bi_flags = mr_attr->mr_flags;
	status = mcxnex_mr_common_rereg(state, mr, pd, &bind, mrhdl_new, op);
	return (status);
}


/*
 * mcxnex_mr_reregister_buf()
 *    Context: Can be called from interrupt or base context.
 */
int
mcxnex_mr_reregister_buf(mcxnex_state_t *state, mcxnex_mrhdl_t mr,
    mcxnex_pdhdl_t pd, ibt_smr_attr_t *mr_attr, struct buf *buf,
    mcxnex_mrhdl_t *mrhdl_new, mcxnex_mr_options_t *op)
{
	mcxnex_bind_info_t	bind;
	int			status;

	/*
	 * Fill in the "bind" struct.  This struct provides the majority
	 * of the information that will be used to distinguish between an
	 * "addr" binding (see above) and a "buf" binding (as is the case
	 * here).  The "bind" struct is later passed to mcxnex_mr_mem_bind()
	 * which does most of the "heavy lifting" for the Mcxnex memory
	 * registration routines.  Note: We have chosen to provide
	 * "b_un.b_addr" as the IB address (when the IBT_MR_PHYS_IOVA flag is
	 * not set).  It is not critical what value we choose here as it need
	 * only be unique for the given RKey (which will happen by default),
	 * so the choice here is somewhat arbitrary.
	 */
	bind.bi_type  = MCXNEX_BINDHDL_BUF;
	bind.bi_buf   = buf;
	if (mr_attr->mr_flags & IBT_MR_PHYS_IOVA) {
		bind.bi_addr  = mr_attr->mr_vaddr;
	} else {
		bind.bi_addr  = (uint64_t)(uintptr_t)buf->b_un.b_addr;
	}
	bind.bi_len   = (uint64_t)buf->b_bcount;
	bind.bi_flags = mr_attr->mr_flags;
	bind.bi_as    = NULL;
	status = mcxnex_mr_common_rereg(state, mr, pd, &bind, mrhdl_new, op);
	return (status);
}


/*
 * mcxnex_mr_sync()
 *    Context: Can be called from interrupt or base context.
 */
/* ARGSUSED */
int
mcxnex_mr_sync(mcxnex_state_t *state, ibt_mr_sync_t *mr_segs, size_t num_segs)
{
	mcxnex_mrhdl_t		mrhdl;
	uint64_t		seg_vaddr, seg_len, seg_end;
	uint64_t		mr_start, mr_end;
	uint_t			type;
	int			status, i;

	/* Process each of the ibt_mr_sync_t's */
	for (i = 0; i < num_segs; i++) {
		mrhdl = (mcxnex_mrhdl_t)mr_segs[i].ms_handle;

		/* Check for valid memory region handle */
		if (mrhdl == NULL) {
			status = IBT_MR_HDL_INVALID;
			goto mrsync_fail;
		}

		mutex_enter(&mrhdl->mr_lock);

