Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_mr.c
	mpt_entry.bnd_qp = 0;	/* dMPT for a qp, check for window */
	status = mcxnex_cmn_ownership_cmd_post(state, SW2HW_MPT, &mpt_entry,
	    sizeof (mcxnex_hw_dmpt_t), mpt->hr_indx, sleep);
	if (status != MCXNEX_CMD_SUCCESS) {
		cmn_err(CE_CONT, "Mcxnex: SW2HW_MPT command failed: %08x\n",
		    status);
		if (status == MCXNEX_CMD_INVALID_STATUS) {
			mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_SRV_LOST);
		}
		status = DDI_FAILURE;
		goto mrcommon_fail7;
	}
no_passown:

	/*
	 * Fill in the rest of the Mcxnex Memory Region handle.  Having
	 * successfully transferred ownership of the MPT, we can update the
	 * following fields for use in further operations on the MR.
	 */
	mr->mr_mttaddr	   = mtt_addr;

	mr->mr_log2_pgsz   = (mr->mr_logmttpgsz - MCXNEX_PAGESHIFT);
	mr->mr_mptrsrcp	   = mpt;
	mr->mr_mttrsrcp	   = mtt;
	mr->mr_pdhdl	   = pd;
	mr->mr_rsrcp	   = rsrc;
	mr->mr_is_umem	   = mr_is_umem;
	mr->mr_is_fmr	   = 0;
	mr->mr_umemcookie  = (mr_is_umem != 0) ? umem_cookie : NULL;
	mr->mr_umem_cbfunc = NULL;
	mr->mr_umem_cbarg1 = NULL;
	mr->mr_umem_cbarg2 = NULL;
	mr->mr_lkey	   = mcxnex_mr_key_swap(mr->mr_lkey);
	mr->mr_rkey	   = mcxnex_mr_key_swap(mr->mr_rkey);
	mr->mr_mpt_type	   = mpt_type;

	/*
	 * If this is userland memory, then we need to insert the previously
	 * allocated entry into the "userland resources database".  This will
	 * allow for later coordination between the mcxnex_umap_umemlock_cb()
	 * callback and mcxnex_mr_deregister().
	 */
	if (mr_is_umem) {
		mcxnex_umap_db_add(umapdb);
	}

	*mrhdl = mr;

	return (DDI_SUCCESS);

/*
 * The following is cleanup for all possible failure cases in this routine
 */
mrcommon_fail7:
	mcxnex_rsrc_free(state, &mtt_refcnt);
mrcommon_fail6:
	mcxnex_mr_mem_unbind(state, bh);
	bind->bi_type = bh->bi_type;
mrcommon_fail5:
	if (mr_is_umem) {
		mcxnex_umap_db_free(umapdb);
	}
mrcommon_fail4:
	if (mr_is_umem) {
		/*
		 * Free up the memory ddi_umem_iosetup() allocates
		 * internally.
		 */
		if (bind->bi_type == MCXNEX_BINDHDL_UBUF) {
			freerbuf(bind->bi_buf);
			_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*bind))
			bind->bi_type = MCXNEX_BINDHDL_NONE;
			_NOTE(NOW_VISIBLE_TO_OTHER_THREADS(*bind))
		}
		ddi_umem_unlock(umem_cookie);
	}
mrcommon_fail3:
	mcxnex_rsrc_free(state, &rsrc);
mrcommon_fail2:
	if (mpt != NULL)
		mcxnex_rsrc_free(state, &mpt);
mrcommon_fail1:
	mcxnex_pd_refcnt_dec(pd);
mrcommon_fail:
	return (status);
}

/*
 * mcxnex_mr_mtt_bind()
 *    Context: Can be called from interrupt or base context.
 */
int
mcxnex_mr_mtt_bind(mcxnex_state_t *state, mcxnex_bind_info_t *bind,
    ddi_dma_handle_t bind_dmahdl, mcxnex_rsrc_t **mtt, uint_t *mtt_pgsize_bits,
    uint_t is_buffer)
{
	uint64_t		nummtt;
	uint_t			sleep;
	int			status;

	/*
	 * Check the sleep flag.  Ensure that it is consistent with the
	 * current thread context (i.e. if we are currently in the interrupt
	 * context, then we shouldn't be attempting to sleep).
	 */
	sleep = (bind->bi_flags & IBT_MR_NOSLEEP) ? DDI_NOSLEEP : DDI_SLEEP;
	if ((sleep == DDI_SLEEP) && (sleep != MCXNEX_SLEEPFLAG_FOR_CONTEXT())) {
		status = IBT_INVALID_PARAM;
		goto mrmttbind_fail;
	}

	/*
	 * Bind the memory and determine the mapped addresses.  This is
	 * the first of two routines that do all the "heavy lifting" for
	 * the Mcxnex memory registration routines.  The mcxnex_mr_mem_bind()
	 * routine takes the "bind" struct with all its fields filled
	 * in and returns a list of DMA cookies (for the PCI mapped addresses
	 * corresponding to the specified address region) which are used by
	 * the mcxnex_mr_fast_mtt_write() routine below.  If we fail here, we
	 * must undo all the previous resource allocation (and PD reference
	 * count).
	 */
	status = mcxnex_mr_mem_bind(state, bind, bind_dmahdl, sleep, is_buffer);
	if (status != DDI_SUCCESS) {
		status = IBT_INSUFF_RESOURCE;
		goto mrmttbind_fail;
	}

	/*
	 * Determine number of pages spanned.  This routine uses the
	 * information in the "bind" struct to determine the required
	 * number of MTT entries needed (and returns the suggested page size -
	 * as a "power-of-2" - for each MTT entry).
	 */
	nummtt = mcxnex_mr_nummtt_needed(state, bind, mtt_pgsize_bits);

	/*
	 * Allocate the MTT entries.  Use the calculations performed above to
	 * allocate the required number of MTT entries. If we fail here, we
	 * must not only undo all the previous resource allocation (and PD
	 * reference count), but we must also unbind the memory.
	 */
	status = mcxnex_rsrc_alloc(state, MCXNEX_MTT, nummtt, sleep, mtt);
	if (status != DDI_SUCCESS) {
		status = IBT_INSUFF_RESOURCE;
		goto mrmttbind_fail2;
	}

	/*
	 * Write the mapped addresses into the MTT entries.  This is part two
	 * of the "heavy lifting" routines that we talked about above.  Note:
	 * we pass the suggested page size from the earlier operation here.
	 * And if we fail here, we again do pretty much the same huge clean up.
	 */
	status = mcxnex_mr_fast_mtt_write(state, *mtt, bind, *mtt_pgsize_bits);
	if (status != DDI_SUCCESS) {
		/*
		 * mcxnex_mr_fast_mtt_write() returns DDI_FAILURE
		 * only if it detects a HW error during DMA.
		 */
		mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_SRV_LOST);
		status = DDI_FAILURE;
		goto mrmttbind_fail3;
	}
	return (DDI_SUCCESS);

/*
 * The following is cleanup for all possible failure cases in this routine
 */
mrmttbind_fail3:
	mcxnex_rsrc_free(state, mtt);
mrmttbind_fail2:
	mcxnex_mr_mem_unbind(state, bind);
mrmttbind_fail:
	return (status);
}


/*
 * mcxnex_mr_mtt_unbind()
 *    Context: Can be called from interrupt or base context.
 */
int
mcxnex_mr_mtt_unbind(mcxnex_state_t *state, mcxnex_bind_info_t *bind,
    mcxnex_rsrc_t *mtt)
{
	/*
	 * Free up the MTT entries and unbind the memory.  Here, as above, we
	 * attempt to free these resources only if it is appropriate to do so.
	 */
	mcxnex_mr_mem_unbind(state, bind);
	mcxnex_rsrc_free(state, &mtt);

	return (DDI_SUCCESS);
}


/*
 * mcxnex_mr_common_rereg()
 *    Context: Can be called from interrupt or base context.
 */
static int
mcxnex_mr_common_rereg(mcxnex_state_t *state, mcxnex_mrhdl_t mr,
    mcxnex_pdhdl_t pd, mcxnex_bind_info_t *bind, mcxnex_mrhdl_t *mrhdl_new,
    mcxnex_mr_options_t *op)
{
	mcxnex_rsrc_t		*mpt;
	ibt_mr_attr_flags_t	acc_flags_to_use;
	ibt_mr_flags_t		flags;
	mcxnex_pdhdl_t		pd_to_use;
	mcxnex_hw_dmpt_t	mpt_entry;
	uint64_t		mtt_addr_to_use, vaddr_to_use, len_to_use;
	uint_t			sleep, dereg_level;
	int			status;

