Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_mr.c
		/*
		 * For first cookie, use the offset field to determine where
		 * the buffer starts.  The end addr is then calculated with the
		 * offset in mind.
		 */
		if (i == 0) {
			first_addr = addr = buf->p_laddr +
			    mem_pattr->pmr_offset;
			endaddr = addr + (mem_pattr->pmr_buf_sz - 1) -
			    mem_pattr->pmr_offset;
		/*
		 * For last cookie, determine end addr based on starting
		 * address and size of the total buffer
		 */
		} else if (i == mem_pattr->pmr_num_buf - 1) {
			addr = buf->p_laddr;
			endaddr = addr + (first_addr + mem_pattr->pmr_len &
			    (mem_pattr->pmr_buf_sz - 1));
		/*
		 * For the middle cookies case, start and end addr are
		 * straightforward.  Just use the laddr, and the size, as all
		 * middle cookies are a set size.
		 */
		} else {
			addr = buf->p_laddr;
			endaddr = addr + (mem_pattr->pmr_buf_sz - 1);
		}

		addr	= addr & ~((uint64_t)pagesize - 1);
		while (addr <= endaddr) {
			/*
			 * Fill in the mapped addresses (calculated above) and
			 * set MCXNEX_MTT_ENTRY_PRESENT flag for each MTT entry.
			 */
			mtt_entry = addr | MCXNEX_MTT_ENTRY_PRESENT;
			mtt_table[i] = htonll(mtt_entry);
			addr += pagesize;
		}
	}

	return (DDI_SUCCESS);
}


/*
 * mcxnex_mtt_refcnt_inc()
 *    Context: Can be called from interrupt or base context.
 */
static uint_t
mcxnex_mtt_refcnt_inc(mcxnex_rsrc_t *rsrc)
{
	mcxnex_sw_refcnt_t *rc;

	rc = (mcxnex_sw_refcnt_t *)rsrc->hr_addr;
	return (atomic_inc_uint_nv(&rc->swrc_refcnt));
}


/*
 * mcxnex_mtt_refcnt_dec()
 *    Context: Can be called from interrupt or base context.
 */
static uint_t
mcxnex_mtt_refcnt_dec(mcxnex_rsrc_t *rsrc)
{
	mcxnex_sw_refcnt_t *rc;

	rc = (mcxnex_sw_refcnt_t *)rsrc->hr_addr;
	return (atomic_dec_uint_nv(&rc->swrc_refcnt));
}
